name=input("Введите имя")
day=input("Введите день недели")
i=0
if day=='Понедельник':
    i=0
if day=='Вторник':
    i=1
if day=='Среда':
    i=2
if day=='Четверг':
    i=3
if day=='Пятница':
    i=4
if day=='Суббота':
    i=5
if day=='Воскресенье':
    i=6
Pm=['баню', 'парилку', 'банечку', 'парилочку', 'баньку', 'село Гадюкино', 'баню в селе Гадюкино']
Pa=['America', 'Brazilia', 'Great Britain', 'Korea', 'Japan', 'Russia', 'Mexico']
Pd=['Ресторан', 'Парк', 'Зоопарк', 'Лесопарк', 'Универ', 'Челябинск', 'Магнитогорск']
if name=='Алексей':
    print(name,": едет в",Pa[i])
if name=='Максим':
    print(name,": едет в",Pm[i])
if name=='Дмитрий':
    print(name,": едет в",Pd[i])